modm-ext/data.modm.io/docs/svd/header_stm32u375xx.svd
        <register>
          <name>APB1SLPENR1</name>
          <description>APB1 Peripherals Clock Enable in Sleep Mode Register 1</description>
          <addressOffset>0xc4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TIM2SLPEN</name>
              <description>TIM2 Sleep Mode Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM3SLPEN</name>
              <description>TIM3 Sleep Mode Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM4SLPEN</name>
              <description>TIM4 Sleep Mode Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM6SLPEN</name>
              <description>TIM6 Sleep Mode Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM7SLPEN</name>
              <description>TIM7 Sleep Mode Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI3SLPEN</name>
              <description>SPI3 Sleep Mode Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WWDGSLPEN</name>
              <description>WWDG Sleep Mode Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI2SLPEN</name>
              <description>SPI2 Sleep Mode Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART3SLPEN</name>
              <description>USART3 Sleep Mode Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UART4SLPEN</name>
              <description>UART4 Sleep Mode Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UART5SLPEN</name>
              <description>UART5 Sleep Mode Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C1SLPEN</name>
              <description>I2C1 Sleep Mode Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C2SLPEN</name>
              <description>I2C2 Sleep Mode Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I3C1SLPEN</name>
              <description>I3C1 Sleep Mode Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRSSLPEN</name>
              <description>CRS Sleep Mode Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPAMPSLPEN</name>
              <description>OPAMP Sleep Mode Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VREFSLPEN</name>
              <description>VREFBUF Sleep Mode Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCAPBSLPEN</name>
              <description>RTCAPB Sleep Mode Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APB1SLPENR2</name>
          <description>APB1 Peripherals Clock Enable in Sleep Mode Register 2</description>
          <addressOffset>0xc8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LPTIM2SLPEN</name>
              <description>LPTIM2 Sleep Mode Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FDCANSLPEN</name>
              <description>FDCAN1 Sleep Mode Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2SLPENR</name>
          <description>APB2 Peripherals Clock Enable in Sleep Mode Register</description>
          <addressOffset>0xcc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TIM1SLPEN</name>
              <description>TIM1 Sleep Mode Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI1SLPEN</name>
              <description>SPI1 Sleep Mode Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART1SLPEN</name>
              <description>USART1 Sleep Mode Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM15SLPEN</name>
              <description>TIM15 Sleep Mode Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM16SLPEN</name>
              <description>TIM16 Sleep Mode Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM17SLPEN</name>
              <description>TIM17 Sleep Mode Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAI1SLPEN</name>
              <description>SAI1 Sleep Mode Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USB1SLPEN</name>
              <description>USB1 Sleep Mode Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I3C2SLPEN</name>
              <description>I3C2 Sleep Mode Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APB3SLPENR</name>
          <description>APB3 Peripherals Clock Enable in Sleep Mode Register</description>
          <addressOffset>0xd0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SYSCFGSLPEN</name>
              <description>SYSCFG Sleep Mode Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPUART1SLPEN</name>
              <description>LPUART1 Sleep Mode Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C3SLPEN</name>
              <description>I2C3 Sleep Mode Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM1SLPEN</name>
              <description>LPTIM1 Sleep Mode Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM3SLPEN</name>
              <description>LPTIM3 Sleep Mode Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM4SLPEN</name>
              <description>LPTIM4 Sleep Mode Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPSLPEN</name>
              <description>COMP Sleep Mode Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB1STPENR1</name>
          <description>AHB1 Peripherals Clock Enable in Stop Mode Register 1</description>
          <addressOffset>0xd8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GPDMA1STPEN</name>
              <description>GPDMA1 Clock Enable in Stop Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADF1STPEN</name>
              <description>ADF1 Clock Enable in Stop Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLASHSTPEN</name>
              <description>FLASH Clock Enable in Stop Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RAMCFGSTPEN</name>
              <description>RAMCFG Clock Enable in Stop Mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GTZC1STPEN</name>
              <description>GTZC1 Clock Enable in Stop Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1STPEN</name>
              <description>SRAM1 Clock Enable in Stop Mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB2STPENR1</name>
          <description>AHB2 Peripherals Clock Enable in Stop Mode Register 1</description>
          <addressOffset>0xdc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GPIOASTPEN</name>
              <description>IO port A Clock Enable in Stop Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOBSTPEN</name>
              <description>IO port B Clock Enable in Stop Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOCSTPEN</name>
              <description>IO port C Clock Enable in Stop Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIODSTPEN</name>
              <description>IO port D Clock Enable in Stop Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOESTPEN</name>
              <description>IO port E Clock Enable in Stop Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOGSTPEN</name>
              <description>IO port G Clock Enable in Stop Mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOHSTPEN</name>
              <description>IO port H Clock Enable in Stop Mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DAC1STPEN</name>
              <description>DAC1 Clock Enable in Stop Mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM2STPEN</name>
              <description>SRAM2 Clock Enable in Stop Mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APB1STPENR1</name>
          <description>APB1 Peripherals Clock Enable in Stop Mode Register 1</description>
          <addressOffset>0xec</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPI3STPEN</name>
              <description>SPI3 Clock Enable in Stop Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI2STPEN</name>
              <description>SPI2 Clock Enable in Stop Mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART3STPEN</name>
              <description>USART3 Clock Enable in Stop Mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UART4STPEN</name>
              <description>UART4 Clock Enable in Stop Mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UART5STPEN</name>
              <description>UART5 Clock Enable in Stop Mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C1STPEN</name>
              <description>I2C1 Clock Enable in Stop Mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C2STPEN</name>
              <description>I2C2 Clock Enable in Stop Mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I3C1STPEN</name>
              <description>I3C1 Clock Enable in Stop Mode</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPAMPSTPEN</name>
              <description>OPAMP Clock Enable in Stop Mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VREFSTPEN</name>
              <description>VREFBUF Clock Enable in Stop Mode</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCAPBSTPEN</name>
              <description>RTCAPB Clock Enable in Stop Mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APB1STPENR2</name>
          <description>APB1 Peripherals Clock Enable in Stop Mode Register 2</description>
          <addressOffset>0xf0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LPTIM2STPEN</name>
              <description>LPTIM2 Clock Enable in Stop Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2STPENR</name>
          <description>APB2 Peripherals Clock Enable in Stop Mode Register</description>
          <addressOffset>0xf4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPI1STPEN</name>
              <description>SPI1 Clock Enable in Stop Mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART1STPEN</name>
              <description>USART1 Clock Enable in Stop Mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USB1STPEN</name>
              <description>USB1 Clock Enable in Stop Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I3C2STPEN</name>
              <description>I3C2 Clock Enable in Stop Mode</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APB3STPENR</name>
          <description>APB3 Peripherals Clock Enable in Stop Mode Register</description>
          <addressOffset>0xf8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LPUART1STPEN</name>
              <description>LPUART1 Clock Enable in Stop Mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C3STPEN</name>
              <description>I2C3 Clock Enable in Stop Mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM1STPEN</name>
              <description>LPTIM1 Clock Enable in Stop Mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM3STPEN</name>
              <description>LPTIM3 Clock Enable in Stop Mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM4STPEN</name>
              <description>LPTIM4 Clock Enable in Stop Mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPSTPEN</name>
              <description>COMP Clock Enable in Stop Mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR1</name>
          <description>Peripherals Independent Clocks Configuration Register 1</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USART1SEL</name>
              <description>USART1SEL: USART1 Kernel Clock Source Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART3SEL</name>
              <description>USART3SEL: USART3 Kernel Clock Source Selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UART4SEL</name>
              <description>UART4SEL: UART4 Kernel Clock Source Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UART5SEL</name>
              <description>UART5SEL: UART5 Kernel Clock Source Selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I3C1SEL</name>
              <description>I3C1SEL: I3C1 Kernel Clock Source Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C1SEL</name>
              <description>I2C1SEL: I2C1 Kernel Clock Source Selection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C2SEL</name>
              <description>I2C2SEL: I2C2 Kernel Clock Source Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I3C2SEL</name>
              <description>I3C2SEL: I3C2 Kernel Clock Source Selection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI2SEL</name>
              <description>SPI2SEL: SPI2 Kernel Clock Source Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM2SEL</name>
              <description>LPTIM2SEL[1:0]: LPTIM2 Kernel Clock Source Selection</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SPI1SEL</name>
              <description>SPI1SEL: SPI1 Kernel Clock Source Selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSTICKSEL</name>
              <description>SYSTICKSEL[1:0]: SYSTICK Clock Source Selection</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FDCANSEL</name>
              <description>FDCANSEL: FDCAN1 Kernel Clock Source Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ICLKSEL</name>
              <description>ICLKSEL[1:0]: Intermediate Clock Source Selection</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>USB1SEL</name>
              <description>USB1SEL: USB1 Kernel Clock Source Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMICSEL</name>
              <description>TIMICSEL[2:0]: TIM16, TIM17 and LPTIM2 Internal Input Capture Kernel Clock Source Selection</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
